title: Outlook Spawning and Office process with Suspicious Command line
id: d0e7ea59-11eb-48eb-8582-66cb89274e49
status: experimental
description: Detects potential phishing where outlook spawns an office executable which spawns a command line or script. This can indicate phishing.
references:
author: GitHub @TripleAAACyberSecurity  .   Twitter @AAACyber1
date: 2021/11/01
modified: 
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent1:
        - ParentImage|endswith:
            - '\outlook.exe'
    selection_child1:
        - Image|endswith:
            - '\excel.exe'
            - '\winword.exe'
            - '\powerpnt.exe'
            - '\mspub.exe'
        - CommandLine|contains:
            - 'powershell.exe' 
            - 'cmd.exe'
            - 'CScript.exe'
            - 'WScript.exe'
    condition: all of selection*
falsepositives:
    - Legitimate downloads from Email
level: medium
