title: NTDS.dit Creation
id: 54a91837-1ee1-4c1b-88be-615cf32683a0
status: experimental
description: Detects the creation of a copy of the Active Directory database (NTDS.dit) containing username and password hashes.
references: []
author: GitHub @AllThingsComputers, Twitter @AllThingsHandle
date: 2021/11/01
tags:
  - attack.collection
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|endswith:
      - '\ntds.dit'
  condition: selection
falsepositives:
  - Rare administrative activity; very unlikely in most environments.
level: medium
